[{
        "bibtex": "@article{gu2025towards,\ntitle = {Towards Metasurface-Assisted Sample Synthesis for Wi-Fi Human Sensing},\nauthor = {Gu, Jiaming and Chen, Shaonan and Sun, Yimiao and Xie, Yadong and Xi, Rui and He, Yuan and Cheng, Qiang},\njournal = {IEEE Internet of Things Journal},\nyear = {2025},\nvolume = {12},\nnumber = {24},\npages = {52207-52216}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "IEEE IOTJ'25",
        "resources": {
            "pdf": "./files/PDF/2025MASS_IoTJ.pdf"
        },
        "abstract": "Wi-Fi human sensing has attracted numerous research studies over the past decade. The rapid advancement of machine learning technology further boosts the development of Wi-Fi human sensing. However, current Wi-Fi human sensing suffers from the “data scarcity” problem: all the existing proposals require collecting a large amount of human-based datasets to train the sensing models, which is laborintensive and may raise ethical concerns in certain scenarios. This obstacle seriously restricts the size, quality, and diversity of available datasets, thereby affecting the sensing performance in terms of accuracy and cross-domain applicability. In order to solve this problem, we in this paper propose Metasurface-Assisted Sample Synthesis (MASS), a novel approach to synthesize high-fidelity Wi-Fi sensing samples that effectively capture both the essential features of human motion and environment-specific multipath characteristics without requiring human involvement. The evaluation results show that MASS is effective in boosting machine learning performance, improving classification accuracy by 18%, and enhancing the cross-domain sensing accuracy by 22%. We further analyze inherent synthesis distortions stemming from hardware limitations and introduce a mitigation technique, which significantly enhances data fidelity, achieving 91.8% accuracy even when training exclusively on synthesized samples. These findings underscore the potential of MASS to facilitate the creation of high-quality, diverse datasets with minimal human involvement and associated labor costs."
    },    
    {
        "bibtex": "@article{sun2025metasurface,\ntitle = {Metasurface-Enabled Multi-Target WiFi Sensing},\nauthor = {Sun, Yimiao and Zhou, Qunyan and Chen, Yulong and Gu, Jiaming and Cheng, Qiang and He, Yuan},\njournal = {IEEE Transactions on Mobile Computing},\nyear = {2025},\nvolume = {},\nnumber = {},\npages = {}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "IEEE TMC'25",
        "resources": {
            "pdf": "./files/PDF/2025SlingShot_TMC.pdf"
        },
        "abstract": "As an emerging technology, WiFi sensing has garnered widespread attention in recent years. However, due to limitations in WiFi bandwidth and hardware capacity, multi-target sensing with WiFi remains an unresolved issue. In this paper, we present SLINGSHOT, a first-of-its-kind approach for multitargetWiFi sensing enabled by metasurface. SLINGSHOT exploits a metasurface’s ability of beam scanning to periodically scan among targets in a high frequency, so their sensing signals can be separated in the time domain. However, the WiFi-initiated and the metasurface-initiated signals will interfere with each other, which could significantly degrade the sensing accuracy. Moreover, the WiFi devices and the metasurface operate in a distributed manner, so the inherent clock offset and clock drift among them make it difficult to accurately separate the sensing signals of the targets. To address the above challenges, SLINGSHOT leverages the metasurface’s ability of phase shifting to cancel interfering signals and designs a passive clock synchronization scheme to synchronize the metasurface and WiFi devices. We implement SLINGSHOT and evaluate it under various settings. Results show that SLINGSHOT can sense up to 8 targets. Respectively compared to the state-of-the-art methods, SLINGSHOT has 6.75 % higher mean accuracy in activity recognition and 58.34 % lower mean error in respiration monitoring."
    },    
    {
        "bibtex": "@article{he2025rf,\ntitle = {RF Computing: A New Realm of IoT Research},\nauthor = {He, Yuan and Sun, Yimiao and Guo, Xiuzhen},\njournal = {Journal of Computer Science and Technology},\nyear = {2025},\nvolume = {40},\nnumber = {4},\npages = {1-16}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "JCST'25",
        "resources": {
            "pdf": "./files/PDF/2025RFComputing.pdf",
            "award": {
                "url": "https://jcst.ict.ac.cn/en/article/2025/4",
                "label": "Cover Article"
                }
        },
        "abstract": "Current Internet of Things (IoT) systems encounter substantial challenges in realizing ubiquitous sensing and connectivity, characterized by constrained sensing coverage, prohibitive deployment costs, and energy inefficiencies inherent in conventional digital-centric architectures. This paper presents RF Computing, an innovative paradigm that exploits radio frequency (RF) signals to simultaneously serve as information carriers and computational operands. By enabling direct information processing through RF signal manipulation in the RF domain, RF Computing effectively bypasses the limitations of traditional digital systems, delivering exceptional energy efficiency and superior performance characteristics. We provide a systematic definition of RF Computing, classify its operational modalities, and showcase representative applications that highlight its transformative potential. The existing research landscape is organized into three principal categories: information injection, transformation, and augmentation. Furthermore, we delineate critical open challenges, including the development of unified theoretical models, RF resource management strategies, analog-digital co-design methodologies, and programming frameworks for RF Computing systems. Finally, we propose promising directions to propel this emerging field forward."
    },    
    {
        "bibtex": "@article{zhou2025multi,\ntitle = {Multi-Person Respiration Detection: A Digital Programmable Metasurface Analysis Approach},\nauthor = {Zhou, Qunyan and Sun, Yimiao and Ma, Jitong and Chen, Yulong and Wang, Zijun and Wang, Siran and Dai, Junyan and Li, Huidong and He, Yuan and Cheng, Qiang},\njournal = {IEEE Internet of Things Journal},\nyear = {2025},\nvolume = {12},\nnumber = {18},\npages = {39116-39129}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "IEEE IOTJ'25",
        "resources": {
            "pdf": "./files/PDF/2025IOTJ.pdf"
        },
        "abstract": "The rapid development of wireless sensing technology has opened new possibilities for non-contact health monitoring. Among them, respiration is crucial information for assessing vital signs. However, traditional methods face challenges of signal interference and overlap in multi-person environments. In this work, we propose a novel method for multi-person respiration detection using a digital programmable metasurface (DPM). This method takes advantage of the modulation characteristics of the DPM in the time and space domain. It divides the Channel State Information (CSI) from the Wi-Fi transmitter into multiple sub-signals in the time domain and modulates the radiation directions of the sub-signals for space redistribution. These signals are received by the Wi-Fi receiver and recombined to restore the CSI in each direction, thus enabling the accurate extraction of respiration signals from targets in different directions. Experimental results show that this method can directionally sense the human respiration information in a specific direction under the static working mode. Under dynamic scanning mode, it can effectively separate and detect the respiration information of four people from different directions. This system has great potential for applications in wireless communication, healthcare, and smart home environments."
    },
    {
        "bibtex": "@article{chen2025sensing,\ntitle = {Sensing Resource Scheduling in 5G vRAN: An Elastic Approach},\nauthor = {Chen, Yulong and Guo, Junchen and Sun, Yimiao and Yao, Haipeng and Liu, Yunhao and He, Yuan},\njournal = {ACM Transactions on Internet of Things},\nyear = {2025},\nvolume = {6},\nnumber = {19},\npages = {1-24}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "ACM TIOT'25",
        "resources": {
            "pdf": "./files/PDF/2025TIOT.pdf"
        },
        "abstract": "The emerging integrated sensing and communication (ISAC) technologies show great potential for 5G NR, offering a new wireless-sensing infrastructure paradigm. Users can benefit from pervasive sensing applications in various scenarios without communication penalties. Given the diverse demands for sensing resources across different sensing tasks, elastic resource scheduling becomes crucial, particularly when resources are constrained. However, existing approaches often treat users equally, limiting the applicability in dealing with diverse sensing tasks in the real world. In this paper, we introduce ElaSe, a pioneering sensing technique that enables elastic and prompt scheduling of sensing resources. At the core of ElaSe is the exploration of the user’s state to precisely determine the sensing resource requirements and schedule resources accordingly. We build the first model for matching sensing resources with sensing demands, and further propose a predictive scheduling scheme to eliminate delays by leveraging the 5G virtualized radio access network (vRAN). ElaSe has been implemented on a CPU-based 5G vRAN and commercial 5G user equipments. We conduct experiments to evaluate the performance of ElaSe under different settings. The results demonstrate that ElaSe outperforms the non-scheduling scheme, with a 34% reduction in trajectory tracking error and a 92% decrease in resource allocation error."
    },
    {
        "bibtex": "@article{xi2025review,\ntitle = {Review on mmWave-based Human Perception},\nauthor = {Xi, Rui and Zhang, Jia and Sun, Yimiao and He, Yuan},\njournal = {Journal of Software},\nyear = {2025},\nvolume = {36},\nnumber = {11},\npages = {5242-5274}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "软件学报'25",
        "resources": {
            "pdf": "./files/PDF/2025mmWave_jos.pdf"
        },
        "abstract": "With the rapid development of embedded technology, mobile computing, and Internet of Things (IoT), more and more sensing devices have penetrated into people’s daily lives, such as smartphones, cameras, smart bracelets, smart routers, headsets and other devices. The built-in sensors can easily collect personal information like locations, activities, vital signs, and social connections, giving birth to a new class of sensing applications - Human-Centric Sensing. Compared with traditional sensing methods, such as wearable-based sensing, vision-based sensing, wireless signal-based sensing, etc., millimeter wave (mmWave) signals have a series of advantages, such as high accuracy, non-line-of-sight, passive sensing (no need to carry sensors), high resolution, easy deployment, and good environmental robustness. mmWave-based sensing has become a research hotspot in academia and industry in recent years, and it can realize the non-contact fine-grained perception of human activities and physical signs. Based on the survey of recent studies, this paper first analyzes the background and research significance of mmWave-based human sensing. This paper categorizes existing methods into four classes including tracking and positioning, motion recognition, biometrics measurement, and human imaging, and introduces commonly used publicly available datasets. Finally the potential research challenges and future directions are discussed, which is promising to achieve accurate, ubiquitous, and stable human perception."
    },
    {
        "bibtex": "@article{sun2025exploiting,\ntitle = {Exploiting Dispersion Effect of Signals for Accurate Indoor WiFi Localization},\nauthor = {Sun, Yimiao and He, Yuan and Zhang, Jiacheng and Na, Xin and Chen, Yande and Wang, Weiguo and Guo, Xiuzhen},\njournal = {ACM Transactions on Sensor Networks},\nyear = {2025},\nvolume = {21},\nnumber = {3},\npages = {1-21}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "ACM TOSN'25",
        "resources": {
            "pdf": "./files/PDF/2025BIFROST_TOSN.pdf"
        },
        "abstract": "WiFi-based device localization is a key technology for smart applications, while most of which rely on LoS signals to work. However, in real-world indoor environments, very few LoS signals are usable for accurate localization. This paper presents Bifrost, a novel hardware-software co-design to cope with this practical problem. The core idea of Bifrost is to reinvent WiFi signals to provide sufficient LoS signals. Specifically, we present a low-cost plug-in design of leaky wave antenna (LWA) that can generate orthogonal polarized signals: On one hand, LWA disperses signals of different frequencies to different angles, thus providing AoA information for the localized target. On the other hand, the target further leverages the antenna polarization mismatch to distinguish AoAs from different LWAs. Besides, fine-grained information in CSI is exploited to mitigate multipath and noise. Besides, a dedicated Kalman filter is proposed to facilitate the cooperation of Bifrost and SpotFi, a state-of-the-art approach, to enhance the availability and accuracy of SpotFi. The evaluation results show that the median localization error of Bifrost is 0.81m, 52.35% less than that of SpotFi. When combined with Bifrost to work in realistic settings, SpotFi can reduce the localization error by 33.54%."
    },
    {
        "bibtex": "@article{sun2025survey,\ntitle = {A Survey of mmWave Backscatter: Applications, Platforms, and Technologies},\nauthor = {Sun, Yimiao and He, Yuan and Zou, Yang and Gu, Jiaming and Yang, Xiaolei and Zhang, Jia and Mao, Ziheng},\njournal = {ACM Computing Surveys},\nyear = {2025},\nvolume = {57},\nnumber = {9},\npages = {1-36}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "ACM CSUR'25",
        "resources": {
            "pdf": "./files/PDF/2025CSUR.pdf"
        },
        "abstract": "As a key enabling technology of the Internet of Things (IoT) and 5G communication networks, millimeter wave (mmWave) backscatter has undergone noteworthy advancements and brought significant improvement to prevailing sensing and communication systems. Past few years have witnessed growing efforts in innovating mmWave backscatter transmitters (e.g., tags and metasurfaces) and the corresponding techniques, which provide efficient information embedding and fine-grained signal manipulation for mmWave backscatter technologies. These efforts have greatly enabled a variety of appealing applications, such as long-range localization, roadside-to-vehicle communication, coverage optimization and large-scale identification. In this paper, we carry out a comprehensive survey to systematically summarize the works related to the topic of mmWave backscatter. Firstly, we introduce the scope of this survey and provide a taxonomy to distinguish two categories of mmWave backscatter research based on the operating principle of the backscatter transmitter: modulation-based and relay-based. Furthermore, existing works in each category are grouped and introduced in detail, with their common applications, platforms and technologies, respectively. Finally, we elaborate on potential directions and discuss related surveys in this area."
    },
    {
        "bibtex": "@article{chen2025fall,\ntitle = {Fall Feature Simulation and Wi-Fi Sensing Dataset Construction Based on Time-Domain Digital Coding Metasurface},\nauthor = {Chen, Shaonan and Gu, Jiaming and Xu, Chao and Sun, Yimiao and Wang, Siran and Chen, Zhanye and Liu, Shuo and Li, Huidong and Dai, Junyan and Cheng, Qiang and He, Yuan},\njournal = {Journal of Radars},\nyear = {2025},\nvolume = {14},\nnumber = {R24247},\npages = {950}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "雷达学报'25",
        "resources": {
            "pdf": "./files/PDF/2025Fall_radar_journal.pdf"
        },
        "abstract": "With the widespread application of Wi-Fi sensing technology in intelligent health monitoring, constructing high-quality perception datasets has become a key challenge. Particularly in monitoring abnormal behaviors, such as falls, traditional methods rely on repeated human experiments, which not only poses safety risks but also raises ethical concerns. To address these issues, this paper proposes a time-domain digital coding metasurface-assisted data acquisition method. By simulating the Doppler effect and micro-Doppler characteristics of the human body, the time-domain digital coding metasurface can effectively replace human experiments and assist in constructing Wi-Fi sensing datasets. To verify the feasibility of this method, we develop a time-domain digital coding metasurface with 0°–360° full-phase modulation capability. Experimental results show that the signals generated by the metasurface retain the motion characteristics of the human body, complement real samples, reduce the complexity of data collection, and finally improve the monitoring accuracy of the classification model significantly. This method provides an innovative and feasible solution for data acquisition for Wi-Fi sensing technology."
    },
    {
        "bibtex": "@article{liu2024real,\ntitle = {Real-Time Continuous Activity Recognition With a Commercial mmWave Radar},\nauthor = {Liu, Yunhao and Zhang, Jia and Chen, Yande and Wang, Weiguo and Yang, Songzhou and Na, Xin and Sun, Yimiao and He, Yuan},\njournal = {IEEE Transactions on Mobile Computing},\nyear = {2025},\nvolume = {24},\nnumber = {3},\npages = {1684-1698}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "IEEE TMC'25",
        "resources": {
            "pdf": "./files/PDF/2024ZuMa_TMC.pdf"
        },
        "abstract": "mmWave-based activity recognition technology has attracted widespread attention as it provides the ability of device-free, ubiquitous and accurate sensing. Recognition of human activities intrinsically demands to be real-time and continuous, but the state of the arts is still far limited with the capacity in this regard. The main obstacle lies in activity sequence segmentation, i.e., locating the boundaries between consecutive activities in an activity sequence. This is a daunting task, due to the unclear activity boundaries and the variable activity duration. In this paper, we propose ZuMa , the first mmWave-based approach to real-time continuous activity recognition. When resorting to a machine learning model for activity recognition, our insight is that the recognition confidence of the recognition model is highly correlated to the accuracy of activity sequence segmentation, so that the former can be utilized as a feedback metric to finely adjust the segmentation boundaries. Based on this insight, ZuMa is a coarse-to-fine grained approach, which includes the fast coarse-grained activity chunk extraction and the find-grained explicit segmentation adjustment and recognition. We have implemented ZuMa with the commercial mmWave radar and evaluated its performance under various settings. The results demonstrate that ZuMa achieves an average recognition error of 12.67%, which is 65.08% and 71.87% lower than that of the two baseline methods. The average recognition delay of ZuMa is only 1.86s."
    },
    {
        "bibtex": "@article{zou2024trident,\ntitle = {Trident: Interference Avoidance in Multi-Reader Backscatter Network via Frequency-Space Division},\nauthor = {Zou, Yang and Na, Xin and Sun, Yimiao and He, Yuan},\njournal = {IEEE/ACM Transactions on Networking},\nyear = {2024},\nvolume = {33},\nnumber = {2},\npages = {541-553}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "IEEE/ACM ToN'24",
        "resources": {
            "pdf": "./files/PDF/2024Trident_ToN.pdf"
        },
        "abstract": "Backscatter is a key technology for battery-free sensing in industrial IoT applications. To fully cover numerous tags in the deployment area, one often needs to deploy multiple readers, each of which communicates with tags within its communication range. However, the actual backscattered signals from a tag are likely to reach a reader outside its communication range and cause interference. Conventional TDMA or CSMA based approaches for interference avoidance separate readers’ media access in time, leading to limited network throughput. In this paper, we propose Trident, a novel backscatter design that enables interference avoidance via frequency-space division. By incorporating a tunable bandpass filter and multiple terminal loads, a Tridenttag can detect its channel condition and adaptively adjust the frequency and the power of its backscattered signals. We further propose a frequency assignment algorithm for the readers. With these designs, all the readers in the network can operate concurrently without being interfered. We implement Tridentand evaluate its performance under various settings. The results demonstrate that Tridentenhances the network throughput by 3.18 × , compared to the TDMA-based scheme."
    },
    {
        "bibtex": "@article{sun2023indoor,\ntitle = {Indoor Drone Localization and Tracking Based on Acoustic Inertial Measurement},\nauthor = {Sun, Yimiao and Wang, Weiguo and Mottola, Luca and Zhang, Jia and Wang, Ruijin and He, Yuan},\njournal = {IEEE Transactions on Mobile Computing},\nyear = {2024},\nvolume = {23},\nnumber = {6},\npages = {7537-7551}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "IEEE TMC'24",
        "resources": {
            "pdf": "./files/PDF/2023AIM_TMC.pdf"
        },
        "abstract": "We present Acoustic Inertial Measurement (AIM), a one-of-a-kind technique for indoor drone localization and tracking. Indoor drone localization and tracking are arguably a crucial, yet unsolved challenge: in GPS-denied environments, existing approaches enjoy limited applicability, especially in Non-Line of Sight (NLoS), require extensive environment instrumentation, or demand considerable hardware/software changes on drones. In contrast, AIM exploits the acoustic characteristics of the drones to estimate their location and derive their motion, even in NLoS settings. We tame location estimation errors using a dedicated Kalman filter and the Interquartile Range rule (IQR) and demonstrate that AIM can support indoor spaces with arbitrary ranges and layouts. We implement AIM using an off-the-shelf microphone array and evaluate its performance with a commercial drone under varied settings. Results indicate that the mean localization error of AIM is 46% lower than that of commercial UWB-based systems in a complex 10m×10m indoor scenario, where state-of-the-art infrared systems would not even work because of NLoS situations. When distributed microphone arrays are deployed, the mean error can be reduced to less than 0.5m in a 20m range, and even support spaces with arbitrary ranges and layouts."
    },
    {
        "bibtex": "@ARTICLE{he2023acoustic,\ntitle = {Acoustic Localization System for Precise Drone Landing},\nauthor = {He, Yuan and Wang, Weiguo and Mottola, Luca and Li, Shuai and Sun, Yimiao and Li, Jinming and Jing, Hua and Wang, Ting and Wang, Yulei},\njournal = {IEEE Transactions on Mobile Computing},\nyear = {2024},\nvolume = {23},\nnumber = {5},\npages = {4126-4144}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "IEEE TMC'24",
        "resources": {
            "pdf": "./files/PDF/2023MicNest_TMC.pdf",
            "award": {
                "url": "https://www.workercn.cn/c/2024-11-22/8398409.shtml",
                "label": "Capital Frontier Academic Achievement"
                }
        },
        "abstract": "We present MicNest : an acoustic localization system enabling precise drone landing. In MicNest , multiple microphones are deployed on a landing platform in carefully devised configurations. The drone carries a speaker transmitting purposefully-designed acoustic pulses. The drone may be localized as long as the pulses are correctly detected. Doing so is challenging: i) because of limited transmission power, propagation attenuation, background noise, and propeller interference, the Signal-to-Noise Ratio (SNR) of received pulses is intrinsically low; ii) the pulses experience non-linear Doppler distortion due to the physical drone dynamics; iii) as location information is used during landing, the processing latency must be reduced to effectively feed the flight control loop. To tackle these issues, we design a novel pulse detector, Matched Filter Tree (MFT), whose idea is to convert pulse detection to a tree search problem. We further present three practical methods to accelerate tree search jointly. Our experiments show that MicNest can localize a drone 120 m away with 0.53% relative localization error at 20 Hz location update frequency. For navigating drone landing, MicNest can achieve a success rate of 94 %. The average landing error (distance between landing point and target point) is only 4.3 cm."
    },
    {
        "bibtex": "@article{he2023detection,\ntitle = {Detection and Identification of Non-Cooperative UAV Using a COTS mmWave Radar},\nauthor = {He, Yuan and Zhang, Jia and Xi, Rui and Na, Xin and Sun, Yimiao and Li, Beibei},\njournal = {ACM Transactions on Sensor Networks},\nyear = {2023},\nvolume = {20},\nnumber = {2},\npages = {1-22}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "ACM TOSN'23",
        "resources": {
            "pdf": "./files/PDF/2023mmHawkeye_TOSN.pdf"
        },
        "abstract": "Small Unmanned Aerial Vehicles (UAVs) are becoming potential threats to security-sensitive areas and personal privacy. A UAV can shoot photos at height, but how to detect such an uninvited intruder is an open problem. This paper presents mmHawkeye, a passive approach for non-cooperative UAV detection and identification with a COTS millimeter wave (mmWave) radar. mmHawkeye doesn’t require prior knowledge of the type, motions, and flight trajectory of the UAV, while exploiting the signal feature induced by the UAV’s periodic micro-motion (PMM) for long-range accurate detection. The design is therefore effective in dealing with low-SNR and uncertain reflected signals from the UAV. After analyzing the theoretical model of the PMM feature, mmHawkeye can further track the UAV’s position containing range, azimuth and altitude angle with dynamic programming and particle filtering, and then identify it with a Long Short-Term Memory (LSTM) based detector. We implement mmHawkeye on a commercial mmWave radar and evaluate its performance under varied settings. The experimental results show that mmHawkeye has a detection accuracy of 95.8% and can realize detection at a range up to 80m."
    }, 
    {
        "bibtex": "@article{wang2023acoustic,\ntitle = {Acoustic Localization of Drones in Precise Landing: The Research and Practice with MicNest},\nauthor = {Wang, Weiguo and He, Yuan and Mottola, Luca and Li, Shuai and Sun, Yimiao and Li, Jinming and Jing, Hua and Wang, Ting and Wang, Yulei},\njournal = {GetMobile: Mobile Computing and Communications},\nyear = {2023},\nvolume = {27},\nnumber = {3},\npages = {27–32}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "ACM GetMobile'23",
        "resources": {
            "pdf": "./files/PDF/2023MicNest_GetMobile.pdf"
        },
        "abstract": "Delivery drones have the potential to revolutionize transportation and distribution of goods. With their autonomous navigation capabilities, they offer an efficient solution to bypass the challenges posed by complex urban traffic and enable instant package delivery. Many industrial firms are actively exploring the commercial feasibility of instant drone deliveries. Meituan, one of the largest companies in this area, devised a systematic approach to instant delivery using drones. The process begins with loading the package onto the drone, which then takes off, ascends to cruising altitude, and sets a direct course towards the designated destination. Typically, this destination is a Meituan-operated self-collection station located near the customer."
    },
    {
        "bibtex": "@ARTICLE{zhang2023survey,\ntitle = {A Survey of mmWave-Based Human Sensing: Technology, Platforms and Applications},\nauthor = {Zhang, Jia and Xi, Rui and He, Yuan and Sun, Yimiao and Guo, Xiuzhen and Wang, Weiguo and Na, Xin and Liu, Yunhao and Shi, Zhenguo and Gu, Tao},\njournal = {IEEE Communications Surveys & Tutorials},\nyear = {2023},\nvolume = {25},\nnumber = {4},\npages = {2052-2087}\n}\n",
        "authors": {
            "boldAuthors": ["Yimiao Sun"]
        },
        "note": "IEEE COMST'23",
        "resources": {
            "pdf": "./files/PDF/2023mmWave_COMST.pdf",
            "award": {
                "url": "https://yimiao-sun.github.io/",
                "label": "ESI Highly Cited Paper"
                }
        },
        "abstract": "With the rapid development of the Internet of Things (IoT) and the rise of 5G communication networks and automatic driving, millimeter wave (mmWave) sensing is emerging and starts impacting our life and workspace. mmWave sensing can sense humans and objects in a contactless way, providing fine-grained sensing ability. In the past few years, many mmWave sensing techniques have been proposed and applied in various human sensing applications (e.g., human localization, gesture recognition, and vital monitoring). We discover the need of a comprehensive survey to summarize the technology, platforms and applications of mmWave-based human sensing. In this survey, we first present the mmWave hardware platforms and some key techniques of mmWave sensing. We then provide a comprehensive review of existing mmWave-based human sensing works. Specifically, we divide existing works into four categories according to the sensing granularity: human tracking and localization, motion recognition, biometric measurement and human imaging. Finally, we discuss the potential research challenges and present future directions in this area."
    }
]